In [1]:
import pandas as pd
pd.__version__

'0.23.3'

In [2]:
ser = pd.Series(['张三','李四','王五'])
ser

0    张三
1    李四
2    王五
dtype: object

In [3]:
list(range(1,4))

[1, 2, 3]

In [5]:
ser = pd.Series(['张三','李四','王五'], list(range(1,4)))
ser

1    张三
2    李四
3    王五
dtype: object

In [6]:
ind = [1,3]
ser[ind]

1    张三
3    王五
dtype: object

In [7]:
type(ser)

pandas.core.series.Series

In [8]:
ser.values

array(['张三', '李四', '王五'], dtype=object)

In [9]:
type(ser.values)

numpy.ndarray

In [10]:
ser2 = pd.Series([18,19,17], index=range(1,4))
ser2

1    18
2    19
3    17
dtype: int64

In [11]:
ser2 + 1

1    19
2    20
3    18
dtype: int64

In [12]:
ser2[ser2 % 2 ==0]

1    18
dtype: int64

In [13]:
ser2

1    18
2    19
3    17
dtype: int64

In [14]:
data = {'beijing':9240,'shanghai':8960,'guangzhou':7400}
data

{'beijing': 9240, 'guangzhou': 7400, 'shanghai': 8960}

In [15]:
ser3 = pd.Series(data)
ser3

beijing      9240
guangzhou    7400
shanghai     8960
dtype: int64

In [16]:
ser3['beijing']

9240

In [17]:
'beijing' in ser3

True

In [18]:
ser4 = pd.Series(data, index=['shanghai','beijing','chongqing'])
ser4

shanghai     8960.0
beijing      9240.0
chongqing       NaN
dtype: float64

In [19]:
ser4.to_dict()

{'beijing': 9240.0, 'chongqing': nan, 'shanghai': 8960.0}

In [20]:
ser4.to_json()

'{"shanghai":8960.0,"beijing":9240.0,"chongqing":null}'

In [21]:
ser4.to_frame()

                0
shanghai   8960.0
beijing    9240.0
chongqing     NaN

## DataFrame

In [22]:
import numpy as np
data = np.arange(100,109).reshape(3,-1)
data

array([[100, 101, 102],
       [103, 104, 105],
       [106, 107, 108]])

In [23]:
df = pd.DataFrame(data)
df

     0    1    2
0  100  101  102
1  103  104  105
2  106  107  108

In [24]:
data = {
    'name':['jack','mary','lily'],
    'age':[19,19,17],
    'height':[1.68,1.37,1.62]
}
df = pd.DataFrame(data)
df

   age  height  name
0   19    1.68  jack
1   19    1.37  mary
2   17    1.62  lily

In [25]:
df.columns

Index(['age', 'height', 'name'], dtype='object')

In [26]:
df.columns = ['age', 'height', 'name']

In [27]:
df

   age  height  name
0   19    1.68  jack
1   19    1.37  mary
2   17    1.62  lily

In [28]:
df = pd.DataFrame(data, columns=['name','age','height','email'])
df

   name  age  height email
0  jack   19    1.68   NaN
1  mary   19    1.37   NaN
2  lily   17    1.62   NaN

In [29]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [30]:
df = pd.DataFrame(data, columns=['name','age','height','email'], index=range(1,4))
df

   name  age  height email
1  jack   19    1.68   NaN
2  mary   19    1.37   NaN
3  lily   17    1.62   NaN